Repository: theundefined/eanalizer
Catalog: locales/*/LC_MESSAGES/eanalizer.po
Languages: pl

source: Energy data analyzer.
pl: Analizator danych energetycznych.

source: List of single data files to analyze.
pl: Lista pojedynczych plikow z danymi do analizy.

source: Path to the directory with .csv files.
pl: Sciezka do katalogu z plikami .csv.

source: Specifies the energy tariff for a single analysis (default: G11).
pl: Okresla taryfe energetyczna dla pojedynczej analizy (domyslnie: G11).

source: Start date of the analysis (format YYYY-MM-DD).
pl: Data poczatkowa analizy (format RRRR-MM-DD).

source: End date of the analysis (format YYYY-MM-DD).
pl: Data koncowa analizy (format RRRR-MM-DD).

source: Capacity of the physical storage in kWh (e.g., 10.0).
pl: Pojemnosc fizycznego magazynu w kWh (np. 10.0).

source: Efficiency of the physical storage (round-trip, default: 0.90, i.e., 90%%).
pl: Sprawność magazynu fizycznego (round-trip, domyslnie: 0.90, czyli 90%%).

source: Path to the CSV file with hourly simulation results.
pl: Sciezka do pliku CSV z wynikami symulacji godzinowej.

source: Path to the CSV file with aggregated daily data.
pl: Sciezka do pliku CSV z zagregowanymi danymi dziennymi.

source: Calculates the optimal storage capacity.
pl: Oblicza optymalna pojemnosc magazynu.

source: Use real RCE prices instead of fixed tariff prices.
pl: Uzyj rzeczywistych cen RCE zamiast stalych cen taryfowych.

source: Enables calculations for the virtual net-metering storage.
pl: Wlacza obliczenia dla wirtualnego magazynu net-metering.

source: Coefficient for energy returned in net-metering (default: 0.8).
pl: Wspolczynnik dla energii oddawanej w net-meteringu (domyslnie: 0.8).

source: Runs a comparison of all available tariffs for the given period.
pl: Uruchamia porównanie wszystkich dostępnych taryf dla zadanego okresu.

source: Enables verbose mode for tariff comparison.
pl: Włącza tryb szczegółowy dla porównania taryf.

source: No .csv files found for processing in: {}
pl: Nie znaleziono plikow .csv do przetworzenia w: {}

source: Found {} files to process:
pl: Znaleziono {} plikow do przetworzenia:

source: No data in the given date range for further analysis.
pl: Brak danych w podanym zakresie dat do dalszej analizy.
